# Unit Type Id Million British Thermal Units Property

Source: https://www.revitapidocs.com/2026/19b18d20-a1e1-b0be-6eea-534e737e1bc8.htm

---

| Unit Type Id Million British Thermal Units Property |
| --- |

Million British thermal units.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId MillionBritishThermalUnits { get; }
```

```
Public Shared ReadOnly Property MillionBritishThermalUnits As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ MillionBritishThermalUnits {
	ForgeTypeId^ get ();
}
```

```
static member MillionBritishThermalUnits : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

UnitTypeId Class Autodesk.Revit.DB Namespace